mediaMicroservices/wrk2/rebuttal_results/c5.xlarge/phone_60s_r100.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 4.246ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.260ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.21ms    1.68ms  10.63ms   88.62%
    Req/Sec    51.48     67.04   272.00     87.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.56ms
 75.000%    4.75ms
 90.000%    6.20ms
 99.000%   10.63ms
 99.900%   17.61ms
 99.990%   22.21ms
 99.999%   22.21ms
100.000%   22.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.587     0.000000            1         1.00
       2.997     0.100000          500         1.11
       3.125     0.200000          996         1.25
       3.245     0.300000         1490         1.43
       3.387     0.400000         1989         1.67
       3.563     0.500000         2482         2.00
       3.671     0.550000         2730         2.22
       3.851     0.600000         2975         2.50
       4.119     0.650000         3224         2.86
       4.431     0.700000         3471         3.33
       4.747     0.750000         3719         4.00
       4.903     0.775000         3844         4.44
       5.023     0.800000         3969         5.00
       5.203     0.825000         4091         5.71
       5.403     0.850000         4215         6.67
       5.743     0.875000         4339         8.00
       5.931     0.887500         4403         8.89
       6.203     0.900000         4463        10.00
       6.463     0.912500         4525        11.43
       6.723     0.925000         4588        13.33
       7.075     0.937500         4649        16.00
       7.231     0.943750         4680        17.78
       7.403     0.950000         4713        20.00
       7.679     0.956250         4742        22.86
       7.951     0.962500         4773        26.67
       8.415     0.968750         4804        32.00
       8.583     0.971875         4819        35.56
       8.775     0.975000         4835        40.00
       9.079     0.978125         4850        45.71
       9.343     0.981250         4866        53.33
       9.783     0.984375         4881        64.00
       9.967     0.985938         4889        71.11
      10.151     0.987500         4897        80.00
      10.415     0.989062         4904        91.43
      10.711     0.990625         4912       106.67
      11.319     0.992188         4920       128.00
      11.487     0.992969         4924       142.22
      11.911     0.993750         4928       160.00
      12.135     0.994531         4933       182.86
      12.463     0.995313         4935       213.33
      13.047     0.996094         4939       256.00
      13.303     0.996484         4941       284.44
      13.735     0.996875         4943       320.00
      14.743     0.997266         4945       365.71
      15.119     0.997656         4947       426.67
      16.335     0.998047         4949       512.00
      16.543     0.998242         4950       568.89
      16.607     0.998437         4951       640.00
      17.295     0.998633         4952       731.43
      17.615     0.998828         4953       853.33
      17.647     0.999023         4954      1024.00
      17.647     0.999121         4954      1137.78
      17.711     0.999219         4955      1280.00
      17.711     0.999316         4955      1462.86
      20.111     0.999414         4956      1706.67
      20.111     0.999512         4956      2048.00
      20.111     0.999561         4956      2275.56
      20.351     0.999609         4957      2560.00
      20.351     0.999658         4957      2925.71
      20.351     0.999707         4957      3413.33
      20.351     0.999756         4957      4096.00
      20.351     0.999780         4957      4551.11
      22.207     0.999805         4958      5120.00
      22.207     1.000000         4958          inf
#[Mean    =        4.213, StdDeviation   =        1.684]
#[Max     =       22.192, Total count    =         4958]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5992 requests in 1.00m, 1.05MB read
Requests/sec:     99.85
Transfer/sec:     17.94KB