mediaMicroservices/wrk2/rebuttal_results/c5.xlarge/phone_60s_r200.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 6.333ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.530ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.79ms    3.21ms  17.61ms   87.02%
    Req/Sec   100.98     68.69   285.00     71.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.82ms
 75.000%    7.04ms
 90.000%    9.80ms
 99.000%   17.61ms
 99.900%   25.74ms
 99.990%   31.60ms
 99.999%   35.23ms
100.000%   35.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.611     0.000000            2         1.00
       3.043     0.100000          995         1.11
       3.281     0.200000         1984         1.25
       3.659     0.300000         2978         1.43
       4.219     0.400000         3969         1.67
       4.823     0.500000         4957         2.00
       5.127     0.550000         5453         2.22
       5.523     0.600000         5949         2.50
       5.947     0.650000         6443         2.86
       6.463     0.700000         6945         3.33
       7.043     0.750000         7436         4.00
       7.347     0.775000         7683         4.44
       7.691     0.800000         7932         5.00
       8.099     0.825000         8180         5.71
       8.575     0.850000         8430         6.67
       9.127     0.875000         8676         8.00
       9.423     0.887500         8797         8.89
       9.799     0.900000         8922        10.00
      10.247     0.912500         9045        11.43
      10.703     0.925000         9169        13.33
      11.167     0.937500         9294        16.00
      11.511     0.943750         9356        17.78
      11.911     0.950000         9418        20.00
      12.407     0.956250         9479        22.86
      12.823     0.962500         9542        26.67
      13.479     0.968750         9603        32.00
      13.783     0.971875         9634        35.56
      14.239     0.975000         9665        40.00
      14.975     0.978125         9696        45.71
      15.647     0.981250         9727        53.33
      16.215     0.984375         9758        64.00
      16.527     0.985938         9773        71.11
      16.911     0.987500         9790        80.00
      17.311     0.989062         9804        91.43
      17.887     0.990625         9820       106.67
      18.639     0.992188         9835       128.00
      19.295     0.992969         9843       142.22
      19.599     0.993750         9851       160.00
      20.255     0.994531         9858       182.86
      21.199     0.995313         9866       213.33
      21.983     0.996094         9874       256.00
      22.303     0.996484         9878       284.44
      22.655     0.996875         9882       320.00
      23.151     0.997266         9886       365.71
      24.127     0.997656         9889       426.67
      24.623     0.998047         9893       512.00
      24.879     0.998242         9895       568.89
      25.119     0.998437         9897       640.00
      25.359     0.998633         9899       731.43
      25.727     0.998828         9901       853.33
      25.919     0.999023         9903      1024.00
      26.207     0.999121         9904      1137.78
      27.199     0.999219         9905      1280.00
      27.359     0.999316         9906      1462.86
      29.151     0.999414         9907      1706.67
      29.199     0.999512         9908      2048.00
      29.199     0.999561         9908      2275.56
      30.063     0.999609         9909      2560.00
      30.063     0.999658         9909      2925.71
      30.191     0.999707         9910      3413.33
      30.191     0.999756         9910      4096.00
      30.191     0.999780         9910      4551.11
      31.599     0.999805         9911      5120.00
      31.599     0.999829         9911      5851.43
      31.599     0.999854         9911      6826.67
      31.599     0.999878         9911      8192.00
      31.599     0.999890         9911      9102.22
      35.231     0.999902         9912     10240.00
      35.231     1.000000         9912          inf
#[Mean    =        5.791, StdDeviation   =        3.214]
#[Max     =       35.200, Total count    =         9912]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11916 requests in 1.00m, 2.09MB read
Requests/sec:    198.58
Transfer/sec:     35.68KB