mediaMicroservices/wrk2/rebuttal_results/c5.xlarge/phone_60s_r300.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 9.322ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 9.598ms, rate sampling interval: 36ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.64ms    8.49ms  42.21ms   88.85%
    Req/Sec   150.57     63.43   305.00     69.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.27ms
 75.000%   13.22ms
 90.000%   20.00ms
 99.000%   42.21ms
 99.900%   79.93ms
 99.990%  103.42ms
 99.999%  108.80ms
100.000%  108.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.661     0.000000            1         1.00
       3.539     0.100000         1492         1.11
       4.687     0.200000         2984         1.25
       5.691     0.300000         4468         1.43
       6.863     0.400000         5964         1.67
       8.271     0.500000         7451         2.00
       8.999     0.550000         8191         2.22
       9.823     0.600000         8945         2.50
      10.783     0.650000         9683         2.86
      11.903     0.700000        10427         3.33
      13.215     0.750000        11166         4.00
      13.967     0.775000        11540         4.44
      14.895     0.800000        11910         5.00
      15.911     0.825000        12282         5.71
      17.023     0.850000        12661         6.67
      18.319     0.875000        13029         8.00
      19.055     0.887500        13215         8.89
      19.999     0.900000        13399        10.00
      21.119     0.912500        13589        11.43
      22.399     0.925000        13773        13.33
      23.839     0.937500        13958        16.00
      25.055     0.943750        14051        17.78
      25.967     0.950000        14143        20.00
      27.343     0.956250        14236        22.86
      29.055     0.962500        14329        26.67
      31.007     0.968750        14422        32.00
      32.079     0.971875        14469        35.56
      33.183     0.975000        14515        40.00
      34.399     0.978125        14562        45.71
      36.319     0.981250        14608        53.33
      38.047     0.984375        14656        64.00
      39.007     0.985938        14678        71.11
      39.935     0.987500        14701        80.00
      41.215     0.989062        14726        91.43
      42.911     0.990625        14748       106.67
      44.607     0.992188        14771       128.00
      46.143     0.992969        14783       142.22
      48.031     0.993750        14794       160.00
      49.919     0.994531        14806       182.86
      52.671     0.995313        14818       213.33
      55.807     0.996094        14829       256.00
      57.087     0.996484        14835       284.44
      59.487     0.996875        14841       320.00
      64.927     0.997266        14847       365.71
      68.735     0.997656        14853       426.67
      72.639     0.998047        14858       512.00
      73.791     0.998242        14861       568.89
      77.119     0.998437        14864       640.00
      77.695     0.998633        14867       731.43
      78.783     0.998828        14870       853.33
      80.575     0.999023        14873      1024.00
      80.959     0.999121        14874      1137.78
      81.919     0.999219        14876      1280.00
      82.879     0.999316        14877      1462.86
      86.719     0.999414        14879      1706.67
      88.319     0.999512        14880      2048.00
      92.415     0.999561        14881      2275.56
      93.695     0.999609        14882      2560.00
      93.695     0.999658        14882      2925.71
      94.527     0.999707        14883      3413.33
      95.423     0.999756        14884      4096.00
      95.423     0.999780        14884      4551.11
     100.479     0.999805        14885      5120.00
     100.479     0.999829        14885      5851.43
     100.479     0.999854        14885      6826.67
     103.423     0.999878        14886      8192.00
     103.423     0.999890        14886      9102.22
     103.423     0.999902        14886     10240.00
     103.423     0.999915        14886     11702.86
     103.423     0.999927        14886     13653.33
     108.799     0.999939        14887     16384.00
     108.799     1.000000        14887          inf
#[Mean    =       10.640, StdDeviation   =        8.488]
#[Max     =      108.736, Total count    =        14887]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17889 requests in 1.00m, 3.14MB read
Requests/sec:    298.14
Transfer/sec:     53.57KB